[
    {
        "title": "The Hunger Games",
        "author": "Suzanne Collins",
        "genre": "Action fiction",
        "description": "In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1586722975l/2767052.jpg",
        "date": {
          "$date": "2008-08-14T04:00:00Z"
        },
        "publisher": "Scholastic Corp.",
        "authorDesc": "Since 1991, Suzanne Collins has been busy writing for children’s television. She has worked on the staffs of several Nickelodeon shows, including the Emmy-nominated hit Clarissa Explains it All and The Mystery Files of Shelby Woo. For preschool viewers, she penned multiple stories for the Emmy-nominated Little Bear and Oswald. She also co-wrote the critically acclaimed Rankin/Bass Christmas special, Santa, Baby! Most recently she was the Head Writer for Scholastic Entertainment’s Clifford’s Puppy Days.",
        "price": 5.99,
         "ratings":3.5,
        "numOfReviews": 6,
        "reviews": [],
        "topSeller": true
      },
      {
        "title": "Catching Fire",
        "author": "Suzanne Collins",
        "genre": "Action fiction",
        "description": "In Catching Fire, the second novel of the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before . . . and surprising readers at every turn.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1586722941l/6148028.jpg",
        "date": {
          "$date": "2009-08-01T04:00:00Z"
        },
        "publisher": "Scholastic Corp.",
        "authorDesc": "Since 1991, Suzanne Collins has been busy writing for children’s television. She has worked on the staffs of several Nickelodeon shows, including the Emmy-nominated hit Clarissa Explains it All and The Mystery Files of Shelby Woo. For preschool viewers, she penned multiple stories for the Emmy-nominated Little Bear and Oswald. She also co-wrote the critically acclaimed Rankin/Bass Christmas special, Santa, Baby! Most recently she was the Head Writer for Scholastic Entertainment’s Clifford’s Puppy Days.",
        "price": 5.99,
         "ratings":2.5,
        "numOfReviews": 2,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "Mockingjay",
        "author": "Suzanne Collins",
        "genre": "Action fiction",
        "description": "Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1586722918l/7260188.jpg",
        "date": {
          "$date": "2010-08-24T04:00:00Z"
        },
        "publisher": "Scholastic Corp.",
        "authorDesc": "Since 1991, Suzanne Collins has been busy writing for children’s television. She has worked on the staffs of several Nickelodeon shows, including the Emmy-nominated hit Clarissa Explains it All and The Mystery Files of Shelby Woo. For preschool viewers, she penned multiple stories for the Emmy-nominated Little Bear and Oswald. She also co-wrote the critically acclaimed Rankin/Bass Christmas special, Santa, Baby! Most recently she was the Head Writer for Scholastic Entertainment’s Clifford’s Puppy Days.",
        "price": 6.99,
         "ratings":3.0,
        "numOfReviews": 1,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Book Thief",
        "author": "Markus Zusak",
        "genre": "Historical fiction",
        "description": "It is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will be busier still.  By her brother's graveside, Liesel's life is changed when she picks up a single object, partially hidden in the snow. It is The Gravedigger's Handbook, left behind there by accident, and it is her first act of book thievery. So begins a love affair with books and words, as Liesel, with the help of her accordian-playing foster father, learns to read. Soon she is stealing books from Nazi book-burnings, the mayor's wife's library, wherever there are books to be found.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1522157426l/19063._SY475_.jpg",
        "date": {
          "$date": "2005-01-01T00:00:00Z"
        },
        "publisher": "Alfred A. Knopf",
        "authorDesc": "Markus Zusak is the author of five books, including the international bestseller, The Book Thief , which spent more than a decade on the New York Times bestseller list, and is translated into more than forty languages – establishing Zusak as one of the most successful authors to come out of Australia.",
        "price": 9.99,
         "ratings":4.5,
       "numOfReviews": 4,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "I Am the Messenger",
        "author": "Markus Zusak",
        "genre": "Realistic fiction",
        "description": "Ed Kennedy is an underage cabdriver without much of a future. He's pathetic at playing cards, hopelessly in love with his best friend, Audrey, and utterly devoted to his coffee-drinking dog, the Doorman. His life is one of peaceful routine and incompetence until he inadvertently stops a bank robbery.  That's when the first ace arrives in the mail.  That's when Ed becomes the messenger.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1398483261l/19057.jpg",
        "date": {
          "$date": "2002-01-10T05:00:00Z"
        },
        "publisher": "Pan Books",
        "authorDesc": "Markus Zusak is the author of five books, including the international bestseller, The Book Thief , which spent more than a decade on the New York Times bestseller list, and is translated into more than forty languages – establishing Zusak as one of the most successful authors to come out of Australia.",
        "price": 4.99,
        "ratings":5.0,
        "numOfReviews": 6,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "Animal Farm",
        "author": "George Orwell",
        "genre": "Dystopian fiction",
        "description": "A farm is taken over by its overworked, mistreated animals. With flaming idealism and stirring slogans, they set out to create a paradise of progress, justice, and equality. Thus the stage is set for one of the most telling satiric fables ever penned –a razor-edged fairy tale for grown-ups that records the evolution from revolution against tyranny to a totalitarianism just as terrible.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1325861570l/170448.jpg",
        "date": {
          "$date": {
            "$numberLong": "-769204800000"
          }
        },
        "publisher": "Secker & Warburg",
        "authorDesc": "Eric Arthur Blair, better known by his pen name George Orwell, was an English author and journalist. His work is marked by keen intelligence and wit, a profound awareness of social injustice, an intense opposition to totalitarianism, a passion for clarity in language, and a belief in democratic socialism.",
        "price": 7.49,
        "ratings":2.0,
        "numOfReviews": 4,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "genre": "Dystopian fiction",
        "description": "Guy Montag is a fireman. In his world, where television rules and literature is on the brink of extinction, firemen start fires rather than put them out. His job is to destroy the most illegal of commodities, the printed book, along with the houses in which they are hidden.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1383718290l/13079982.jpg",
        "date": {
          "$date": {
            "$numberLong": "-511297200000"
          }
        },
        "publisher": "Ballantine Books",
        "authorDesc": "Ray Douglas Bradbury, American novelist, short story writer, essayist, playwright, screenwriter and poet, was born August 22, 1920 in Waukegan, Illinois. He graduated from a Los Angeles high school in 1938. Although his formal education ended there, he became a \"student of life,\" selling newspapers on L.A. street corners from 1938 to 1942, spending his nights in the public library and his days at the typewriter. He became a full-time writer in 1943, and contributed numerous short stories to periodicals before publishing a collection of them, Dark Carnival, in 1947.",
        "price": 3.99,
         "ratings":3.5,
        "numOfReviews": 8,
        "reviews": [],
        "topSeller": true
      },
      {
        "title": "Green Eggs and Ham",
        "author": "Dr. Seuss",
        "genre": "Children fiction",
        "description": "“Do you like green eggs and ham?” asks Sam-I-am in this Beginner Book by Dr. Seuss. In a house or with a mouse? In a boat or with a goat? On a train or in a tree? Sam keeps asking persistently. With unmistakable characters and signature rhymes, Dr. Seuss’s beloved favorite has cemented its place as a children’s classic. In this most famous of cumulative tales, the list of places to enjoy green eggs and ham, and friends to enjoy them with, gets longer and longer. Follow Sam-I-am as he insists that this unusual treat is indeed a delectable snack to be savored everywhere and in every way.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1468680100l/23772.jpg",
        "date": {
          "$date": {
            "$numberLong": "-296251200000"
          }
        },
        "publisher": "Penguin Random House LLC.",
        "authorDesc": "Theodor Seuss Geisel was born 2 March 1904 in Springfield, MA. He graduated Dartmouth College in 1925, and proceeded on to Oxford University with the intent of acquiring a doctorate in literature. At Oxford he met Helen Palmer, who he wed in 1927. He returned from Europe in 1927, and began working for a magazine called Judge, the leading humor magazine in America at the time, submitting both cartoons and humorous articles for them. Additionally, he was submitting cartoons to Life, Vanity Fair and Liberty. In some of his works, he'd made reference to an insecticide called Flit. These references gained notice, and led to a contract to draw comic ads for Flit. This association lasted 17 years, gained him national exposure, and coined the catchphrase \"Quick, Henry, the Flit!\"",
        "price": 5.99,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": true
      },
      {
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "genre": "Historical fiction",
        "description": "The Great Gatsby, F. Scott Fitzgerald's third book, stands as the supreme achievement of his career. This exemplary novel of the Jazz Age has been acclaimed by generations of readers. The story is of the fabulously wealthy Jay Gatsby and his new love for the beautiful Daisy Buchanan, of lavish parties on Long Island at a time when The New York Times noted \"gin was the national drink and sex the national obsession,\" it is an exquisitely crafted tale of America in the 1920s.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1490528560l/4671._SY475_.jpg",
        "date": {
          "$date": {
            "$numberLong": "-1411498800000"
          }
        },
        "publisher": "Charles Scribner's Sons",
        "authorDesc": "Francis Scott Key Fitzgerald was an American writer of novels and short stories, whose works have been seen as evocative of the Jazz Age, a term he himself allegedly coined. He is regarded as one of the greatest twentieth century writers. Fitzgerald was of the self-styled \"Lost Generation,\" Americans born in the 1890s who came of age during World War I. He finished four novels, left a fifth unfinished, and wrote dozens of short stories that treat themes of youth, despair, and age. He was married to Zelda Fitzgerald.",
        "price": 10.99,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Hobbit, or There and Back Again",
        "author": "J.R.R. Tolkien",
        "genre": "Fantasy fiction",
        "description": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546071216l/5907.jpg",
        "date": {
          "$date": {
            "$numberLong": "-1020369600000"
          }
        },
        "publisher": "Allen & Unwin",
        "authorDesc": "John Ronald Reuel Tolkien, CBE was an English writer, poet, WWI veteran (a First Lieutenant in the Lancashire Fusiliers, British Army), philologist, and university professor, best known as the author of the high fantasy classic works The Hobbit and The Lord of the Rings .",
        "price": 15.99,
         "ratings":3.5,
        "numOfReviews": 2,
        "reviews": [],
        "topSeller": true
      },
      {
        "title": "J.R.R. Tolkien 4-Book Boxed Set: The Hobbit and The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "genre": "Fantasy fiction",
        "description": "This four-volume, boxed set contains J.R.R. Tolkien's epic masterworks The Hobbit and the three volumes of The Lord of the Rings (The Fellowship of the Ring, The Two Towers, and The Return of the King).",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1346072396l/30.jpg",
        "date": {
          "$date": "2012-09-25T04:00:00Z"
        },
        "publisher": "Ballantine Books",
        "authorDesc": "John Ronald Reuel Tolkien, CBE was an English writer, poet, WWI veteran (a First Lieutenant in the Lancashire Fusiliers, British Army), philologist, and university professor, best known as the author of the high fantasy classic works The Hobbit and The Lord of the Rings .",
        "price": 39.99,
        "ratings":5.0,
        "numOfReviews": 1,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "genre": "Historical fiction",
        "description": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1553383690l/2657.jpg",
        "date": {
          "$date": "2006-05-23T04:00:00Z"
        },
        "publisher": "Harper Perennial Modern Classics",
        "authorDesc": "Harper Lee, known as Nelle, was born in the Alabama town of Monroeville, the youngest of four children of Amasa Coleman Lee and Frances Cunningham Finch Lee. Her father, a former newspaper editor and proprietor, was a lawyer who served on the state legislature from 1926 to 1938. As a child, Lee was a tomboy and a precocious reader, and enjoyed the friendship of her schoolmate and neighbor, the young Truman Capote. Lee continued as a reservation clerk until the late 50s, when she devoted herself to writing. She lived a frugal life, traveling between her cold-water-only apartment in New York to her family home in Alabama to care for her father.",
        "price": 5.99,
         "ratings":3.5,
        "numOfReviews": 3,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Chronicles of Narnia",
        "author": "C.S. Lewis",
        "genre": "Fantasy fiction",
        "description": "Journeys to the end of the world, fantastic creatures, and epic battles between good and evil—what more could any reader ask for in one book? The book that has it all is The Lion, the Witch and the Wardrobe, written in 1949 by Clive Staples Lewis. But Lewis did not stop there. Six more books followed, and together they became known as The Chronicles of Narnia.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1449868701l/11127._SY475_.jpg",
        "date": {
          "$date": "2002-09-16T04:00:00Z"
        },
        "publisher": "HarperCollins",
        "authorDesc": "Clive Staples Lewis was one of the intellectual giants of the twentieth century and arguably one of the most influential writers of his day. He was a Fellow and Tutor in English Literature at Oxford University until 1954. He was unanimously elected to the Chair of Medieval and Renaissance Literature at Cambridge University, a position he held until his retirement. He wrote more than thirty books, allowing him to reach a vast audience, and his works continue to attract thousands of new readers every year. His most distinguished and popular accomplishments include Mere Christianity, Out of the Silent Planet, The Great Divorce, The Screwtape Letters, and the universally acknowledged classics The Chronicles of Narnia. To date, the Narnia books have sold over 100 million copies and been transformed into three major motion pictures.",
        "price": 19.99,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "Dracula",
        "author": "Bram Stoker",
        "genre": "Horror fiction",
        "description": "A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and \"Dracula's Guest,\" the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. \"Dramatic and Film Variations\" focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387151694l/17245.jpg",
        "date": {
          "$date": {
            "$numberLong": "-51739200000"
          }
        },
        "publisher": "Norton",
        "authorDesc": "He was born Abraham Stoker in 1847 at 15 Marino Crescent – then as now called \"The Crescent\" – in Fairview, a coastal suburb of Dublin, Ireland. His parents were Abraham Stoker and the feminist Charlotte Mathilda Blake Thornely. Stoker was the third of seven children. Abraham and Charlotte were members of the Clontarf Church of Ireland parish and attended the parish church (St. John the Baptist located on Seafield Road West) with their children, who were both baptised there. Throughout his adult life he was a popular and widely acclaimed horror novel writer.",
        "price": 7.99,
         "ratings":4.5,
       "numOfReviews": 2,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Adventures of Huckleberry Finn",
        "author": "Mark Twain",
        "genre": "Historical fiction",
        "description": "A nineteenth-century boy from a Mississippi River town recounts his adventures as he travels down the river with a runaway slave, encountering a family involved in a feud, two scoundrels pretending to be royalty, and Tom Sawyer's aunt who mistakes him for Tom.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546096879l/2956.jpg",
        "date": {
          "$date": "2002-12-31T05:00:00Z"
        },
        "publisher": "Penguin Classics",
        "authorDesc": "Samuel Langhorne Clemens, better known by his pen name Mark Twain, was an American author and humorist. He is noted for his novels Adventures of Huckleberry Finn (1885), called \"the Great American Novel\", and The Adventures of Tom Sawyer (1876).",
        "price": 8.99,
         "ratings":1.5,
        "numOfReviews": 4,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Adventures of Tom Sawyer",
        "author": "Mark Twain",
        "genre": "Historical fiction",
        "description": "The Adventures of Tom Sawyer revolves around the youthful adventures of the novel's schoolboy protagonist, Thomas Sawyer, whose reputation precedes him for causing mischief and strife. Tom lives with his Aunt Polly, half-brother Sid, and cousin Mary in the quaint town of St. Petersburg, just off the shore of the Mississippi River. St. Petersburg is described as a typical small-town atmosphere where the Christian faith is predominant, the social network is close-knit, and familiarity resides.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1404811979l/24583.jpg",
        "date": {
          "$date": "2006-02-08T05:00:00Z"
        },
        "publisher": "Penguin Classics",
        "authorDesc": "Samuel Langhorne Clemens, better known by his pen name Mark Twain, was an American author and humorist. He is noted for his novels Adventures of Huckleberry Finn (1885), called \"the Great American Novel\", and The Adventures of Tom Sawyer (1876).",
        "price": 13.49,
         "ratings":2.5,
        "numOfReviews": 3,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Great Divorce",
        "author": "C.S. Lewis",
        "genre": "Religious fiction",
        "description": "C.S. Lewis’ The Great Divorce is a classic Christian allegorical tale about a bus ride from hell to heaven. An extraordinary meditation upon good and evil, grace and judgment, Lewis’s revolutionary idea in the The Great Divorce is that the gates of Hell are locked from the inside. Using his extraordinary descriptive powers, Lewis’ The Great Divorce will change the way we think about good and evil. ",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1435968645l/25845273._SX318_.jpg",
        "date": {
          "$date": "2015-04-21T04:00:00Z"
        },
        "publisher": "HarperCollins",
        "authorDesc": "Clive Staples Lewis was one of the intellectual giants of the twentieth century and arguably one of the most influential writers of his day. He was a Fellow and Tutor in English Literature at Oxford University until 1954. He was unanimously elected to the Chair of Medieval and Renaissance Literature at Cambridge University, a position he held until his retirement. He wrote more than thirty books, allowing him to reach a vast audience, and his works continue to attract thousands of new readers every year. His most distinguished and popular accomplishments include Mere Christianity, Out of the Silent Planet, The Great Divorce, The Screwtape Letters, and the universally acknowledged classics The Chronicles of Narnia. To date, the Narnia books have sold over 100 million copies and been transformed into three major motion pictures.",
        "price": 10.49,
        "ratings":4.0,
        "numOfReviews": 1,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "The Alchemist",
        "author": "Paulo Coelho",
        "genre": "Philosophical fiction",
        "description": "Paulo Coelho's enchanting novel has inspired a devoted following around the world. This story, dazzling in its powerful simplicity and soul-stirring wisdom, is about an Andalusian shepherd boy named Santiago who travels from his homeland in Spain to the Egyptian desert in search of a treasure buried near the Pyramids. Along the way he meets a Gypsy woman, a man who calls himself king, and an alchemist, all of whom point Santiago in the direction of his quest. No one knows what the treasure is, or if Santiago will be able to surmount the obstacles in his path. But what starts out as a journey to find worldly goods turns into a discovery of the treasure found within. Lush, evocative, and deeply humane, the story of Santiago is an eternal testament to the transforming power of our dreams and the importance of listening to our hearts.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1466865542l/18144590._SY475_.jpg",
        "date": {
          "$date": "2014-04-15T04:00:00Z"
        },
        "publisher": "HarperOne",
        "authorDesc": "The Brazilian author PAULO COELHO was born in 1947 in the city of Rio de Janeiro. Before dedicating his life completely to literature, he worked as theatre director and actor, lyricist and journalist. In 1986, PAULO COELHO did the pilgrimage to Saint James of Compostella, an experience later to be documented in his book The Pilgrimage. In the following year, COELHO published The Alchemist. Slow initial sales convinced his first publisher to drop the novel, but it went on to become one of the best selling Brazilian books of all time.",
        "price": 12.49,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": true
      },
      {
        "title": "Romeo and Juliet",
        "author": "William Shakespeare",
        "genre": "Romantic fiction",
        "description": "In Romeo and Juliet, Shakespeare creates a violent world, in which two young people fall in love. It is not simply that their families disapprove; the Montagues and the Capulets are engaged in a blood feud. In this death-filled setting, the movement from love at first sight to the lovers’ final union in death seems almost inevitable. And yet, this play set in an extraordinary world has become the quintessential story of young love. In part because of its exquisite language, it is easy to respond as if it were about all young lovers.",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1572098085l/18135._SY475_.jpg",
        "date": {
          "$date": "2004-01-01T05:00:00Z"
        },
        "publisher": "Simon Schuster",
        "authorDesc": "William Shakespeare (baptised 26 April 1564) was an English poet and playwright, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist. He is often called England's national poet and the \"Bard of Avon\" (or simply \"The Bard\"). His surviving works consist of 38 plays, 154 sonnets, two long narrative poems, and several other poems. His plays have been translated into every major living language, and are performed more often than those of any other playwright.",
        "price": 15.99,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": false
      },
      {
        "title": "A Midsummer Night's Dream",
        "author": "William Shakespeare",
        "genre": "Romantic fiction",
        "description": "Shakespeare's intertwined love polygons begin to get complicated from the start--Demetrius and Lysander both want Hermia but she only has eyes for Lysander. Bad news is, Hermia's father wants Demetrius for a son-in-law. On the outside is Helena, whose unreturned love burns hot for Demetrius. Hermia and Lysander plan to flee from the city under cover of darkness but are pursued by an enraged Demetrius (who is himself pursued by an enraptured Helena). In the forest, unbeknownst to the mortals, Oberon and Titania (King and Queen of the faeries) are having a spat over a servant boy. The plot twists up when Oberon's head mischief-maker, Puck, runs loose with a flower which causes people to fall in love with the first thing they see upon waking. Throw in a group of labourers preparing a play for the Duke's wedding (one of whom is given a donkey's head and Titania for a lover by Puck) and the complications become fantastically funny. ",
        "cover": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327874534l/1622.jpg",
        "date": {
          "$date": "2016-07-01T04:00:00Z"
        },
        "publisher": "Simon & Schuster Paperbacks",
        "authorDesc": "William Shakespeare (baptised 26 April 1564) was an English poet and playwright, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist. He is often called England's national poet and the \"Bard of Avon\" (or simply \"The Bard\"). His surviving works consist of 38 plays, 154 sonnets, two long narrative poems, and several other poems. His plays have been translated into every major living language, and are performed more often than those of any other playwright.",
        "price": 15.99,
        "ratings":0.0,
        "numOfReviews": 0,
        "reviews": [],
        "topSeller": false
    }

]